In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt 
import seaborn

### read data and pickle it all

In [2]:
def read_data():
    data = pd.read_csv('/home/data-sci/Desktop/analysis/course/nesarc_pds.csv',low_memory=False)
#     data.rename(columns={'S1Q4A': 'age_afm','S1Q2J':'age','S1Q6A': 'edu'}, inplace=True)
                          
    return data

In [20]:
def pickle_data(data):
    data.to_pickle('cleaned_data.pickle')


def get_pickle():
    return pd.read_pickle('cleaned_data.pickle')

In [4]:
def the_data():
    """this function will check for the pickle file if not fond
    it will read the csv file then pickle it  """
    if os.path.isfile('cleaned_data.pickle'):
        data = get_pickle()

    else:
        data = read_data()
        pickle_data(data)
    return data

In [5]:
data = the_data()

In [6]:
data.shape

(43093, 3008)

In [20]:
data.head(20)

   age_afm  edu  consumer h_often_12m h_often_5beer_12m
0             8         3
1       23    8         1          10                11
2       35    6         3
3             8         2
4       22   12         2
5       26   14         1
6            10         1
7             8         1
8            12         1           9                11
9             8         1
10      24    8         1           7                11
11      23   10         1
12      25   12         1           7                10
13      24   10         1           4                 5
14      21    8         1           3                11
15      18   14         2
16           13         1          10                11
17      37    8         2
18      16    7         1
19           11         1           6                11

In [7]:
data2 = data[['MARITAL','S1Q4A','AGE','S1Q1C','S1Q1D1','S1Q1D2','S1Q1D3','S1Q1D4','S1Q1D5','S1Q4B','S1Q6A']]

In [8]:
del data

In [9]:
data2 = data2.rename(columns={'MARITAL':'marital','S1Q4A':'age_1st_mar',
                      'AGE':'age','S1Q1C':'hispanich','S1Q1D1':'indian','S1Q1D2':'asian','S1Q1D3':'black','S1Q1D4':'HAWAIIAN','S1Q1D5':'WHITE','S1Q4B':'how_mar_ended','S1Q6A':'edu'})

In [10]:
data2.shape

(43093, 11)

In [11]:
data2.head()

,marital,age_1st_mar,age,hispanich,indian,asian,black,HAWAIIAN,WHITE,how_mar_ended,edu
0,6,,23,1,2,2,2,2,1,,8
1,1,23,28,1,2,2,2,2,1,,8
2,3,35,81,1,2,2,2,2,1,2,6
3,6,,18,1,2,2,2,2,1,,8
4,1,22,36,2,2,2,1,2,2,,12

#### convert all to numaric values

In [ ]:
def to_numaric(data):
    for i in data.columns:
        data[i] = data[i].convert_objects(convert_numeric=True)

In [12]:
data2.dtypes

marital           int64
age_1st_mar      object
age               int64
hispanich         int64
indian            int64
asian             int64
black             int64
HAWAIIAN          int64
WHITE             int64
how_mar_ended    object
edu               int64
dtype: object

## print the frquancy of the values

In [ ]:
def distribution(var_data):
    """this function will print out the frequency
    distribution for every variable in the data-frame   """
    #var_data = pd.to_numeric(var_data, errors='ignore')
    print("the count of the values in {}".format(var_data.name))
    print(var_data.value_counts())
    print("the % of every value in the {} variable  ".format(var_data.name))
    print(var_data.value_counts(normalize=True))
    print("-----------------------------------")


def print_dist():
    # this function loops though the variables and print them out
    for i in data2.columns:
        print(distribution(data2[i]))


print_dist()

## 1- recoding unknown values

from the variable "how_mar_ended" `HOW FIRST MARRIAGE ENDED` will code the `9` value from Unknown to NaN

In [13]:
data2['how_mar_ended'] = data2['how_mar_ended'].replace(9, np.nan)
data2['age_1st_mar'] = data2['age_1st_mar'].replace(99, np.nan)

In [14]:
data2['how_mar_ended'].value_counts(sort=False, dropna=False)

1     4025
9       98
3      201
2    10803
     27966
Name: how_mar_ended, dtype: int64

## 2- remaping values

In [15]:

#the first variable is 'marital'
marital_remap_dict = {  1:'Married',
                        2: 'Living with someone as if married',
                        3: 'Widowed',
                        4: 'Divorced',
                        5: 'Separated',
                        6: 'Never Married'
                        
                      }
data2['marital'] =  data2['marital'].map(marital_remap_dict)

#the second value will remap in the education level 
edu_remap_dict = {  1: 'No formal schooling',
                    2: 'K, 1 or 2',
                    3: '3 or 4',
                    4: '5 or 6',
                    5: '7',
                    6: '8',
                    7: '(grades 9-11)',
                    8: 'Completed high school',
                    9: ' degree',
                    10: 'Some college (no degree)',
                    11: 'technical 2-year degree',
                    12: 'bachelor\'s',
                    14: 'master\'s'
                 }
data2['edu'] =  data2['edu'].map(edu_remap_dict)

In [16]:


def ETHNICITY(row):
    if row['hispanich'] == 1:
        return 'hispanich'
    if row['indian'] == 1:
        return 'indian'
    if row['asian'] == 1:
        return 'asian'
    if row['HAWAIIAN'] == 1:
        return 'hawaian'
    if row['WHITE'] == 1:
        return 'white'
    if row['black'] == 1:
        return 'black'


data2['ETHNICITY'] = data2.apply(lambda row: ETHNICITY(row), axis=1)

In [17]:
data2.head(5)

,marital,age_1st_mar,age,hispanich,indian,asian,black,HAWAIIAN,WHITE,how_mar_ended,edu,ETHNICITY
0,Never Married,,23,1,2,2,2,2,1,,Completed high school,hispanich
1,Married,23,28,1,2,2,2,2,1,,Completed high school,hispanich
2,Widowed,35,81,1,2,2,2,2,1,2,8,hispanich
3,Never Married,,18,1,2,2,2,2,1,,Completed high school,hispanich
4,Married,22,36,2,2,2,1,2,2,,bachelor's,black

In [23]:
pickle_data(data2)